using UnityEngine;

[System.Serializable]
public class QuestDialogue
{
    // =========================================================
    // 会話テキスト
    // =========================================================

    [Header("表示する文章")]
    [TextArea(2, 5)]
    public string text;


    // =========================================================
    // 会話画像
    // =========================================================

    [Header("表示する会話画像")]
    [Tooltip("この会話で表示する画像")]
    public Sprite dialogueImage;


    // =========================================================
    // 効果音
    // =========================================================

    [Header("この文章で鳴らす効果音")]
    public AudioClip[] soundEffects;


    // =========================================================
    // エフェクト
    // =========================================================

    [Header("この文章で再生するエフェクト")]
    public GameObject[] effects;
}